In [1]:
import pandas as pd
df = pd.DataFrame([[101,'frank', 'M', 29], [102,'mary', 'F', 23], [103,'tom', 'M', 35], [104,'ted', 'M', 33], [105,'jean', 'F', 21], [106,'lisa', 'F', 20]],
                  columns = ['userid','name', 'gender', 'age'])
df

   userid   name gender  age
0     101  frank      M   29
1     102   mary      F   23
2     103    tom      M   35
3     104    ted      M   33
4     105   jean      F   21
5     106   lisa      F   20

#### 筛选男性

In [2]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [3]:
df[df['gender'] == 'M']

   userid   name gender  age
0     101  frank      M   29
2     103    tom      M   35
3     104    ted      M   33

#### 筛选年龄大于30

In [5]:
df[df['age'] > 30]

   userid name gender  age
2     103  tom      M   35
3     104  ted      M   33

#### 筛选男性且年龄大于30

In [8]:
df[(df['gender'] == 'M') & (df['age'] > 30)]

   userid name gender  age
2     103  tom      M   35
3     104  ted      M   33

#### 筛选男性或年龄大于30

In [10]:
df[(df['gender'] == 'M') | (df['age'] > 30)]

   userid   name gender  age
0     101  frank      M   29
2     103    tom      M   35
3     104    ted      M   33